// import { Link } from 'react-router-dom';
import { Wrapper, ParagraphStyled } from './About.styled';

export default function About() {
  return (
    <Wrapper>
      {/* <Title></Title> */}
      <ParagraphStyled>
        Олег Краюхін — сучасний український письменник, відомий своїм дебютним
        романом «Вітер у голові», який вийшов у 2025 році. Ця книга поєднує
        елементи пригодницького фентезі та сатиричної прози, розповідаючи
        історію львівського велокур’єра Максима, який після участі в
        експерименті з вакциною потрапляє у вир неймовірних подій протягом
        одного тижня. Книжковий інтернет-магазин Наш Формат Роман отримав
        позитивні відгуки за дотепний стиль, гумор та живі діалоги. (Книга
        доступна в українських книжкових онлайн-магазинах, зокрема в «Наш
        Формат» та «Bizlit». )
      </ParagraphStyled>
      <ParagraphStyled>
        Олег Краюхін активно взаємодіє зі своєю аудиторією, особисто даруючи
        книги з автографами, що свідчить про його відкритість та бажання
        підтримувати зв'язок із читачами. Instagram Хоча детальна біографічна
        інформація про автора наразі обмежена, його творчість вже привернула
        увагу літературної спільноти та читачів.
      </ParagraphStyled>
    </Wrapper>
  );
}
