import foto from '../images/foto.jpg';
import basketball from '../images/ball.jpg';
import bike from '../images/bike.jpg';
import windCover from '../images/wind-in-the-head2.avif';
import noMoney from '../images/nomoney.png';
import writing from '../images/next_book.png';
import autograph from '../images/aurograph.png';

import {
  GmailIcon,
  FacebookIcon,
  TelegramIcon,
  // WhatsappIcon,
  InstagramIcon,
  XIcon,
} from '../components/Contacts/Contacts.styled';

export const data = {
  foto,
  basketball,
  bike,
  windCover,
  noMoney,
  autograph,
  text1: `В якийсь момент життя я просто відмовився дорослішати. Так, це трохи дивно звучить, коли одружений вже 16 років, маєш двох синів, кота, хом’яка, домашнього привида, тарганів в голові, купу болячок, три роботи і ще купу всього, але… Ну, серйозно. Бути дорослим – нудно. Останнім часом, коли дивлюся на однолітків, дивуюся – чому вони такі старі? Чомусь раптом вони всі стали такими серйозними й невеселими дядьками й тітками. Капець якийсь, аж страшно. Не розумію їх. Вони ніби втратили важливу частинку своєї душі, обміняли її на нові квартири й авто, заклали під відсоток в банку самого Мефістотеля, взяли іпотеку на «зону комфорту» і ніяк не хочуть з неї вилазити. Нудно…`,
  text2: `Ідея написати книжку блукала зі мною все життя, постійно була десь поруч, але чимось конкретним ніяк не закінчувалась. Все змінило знайомство зі справжньою письменницею. Живою. Це була Ірина Червінська, колега по роботі, з якою ми перетинались в транспорті. Так, я розумію, що звучить це дещо дивно, але для мене тоді, живучи в своїй обмеженій бульбашці, письменники – це були ті, хто висів в школі, портрети на стінах, або ті, що вже давно померли. А тут, раптом, виявилось, що писати, насправді, можна… усім. І для цього не потрібно нічого особливого, тільки бажання. І я вхопився за цей шанс...`,
  text3: `Про що писати, я вже давно знав. Ідея народилася, ще тоді, коли жив у Львові. Хотів написати історію про велокур’єра, який постійно потрапляє у всілякі неприємності, розвозячи пакунки адресатам. Це мало бути щось в стилі фільмів Тарантіно та Гая Річі, динамічне, авантюрне і трохи дурнувате. Та в процесі написання, в якийсь момент зрозумів, що текст виходить не таким вже й простим. Я намагався описати проблеми, з якими стикається сучасна молодь: пошук свого місця в цьому світі, дорослішання та складні моральні вибори, які доводиться робити, дружба, що тягне тебе на дно, осуд оточуючих й думки про майбутнє. До цього всього додалася й умовно-фантастична складова, а зверху це все ще приправилось відбірними мемчиками та відсилками на маскультуру.`,
  text4: `Я не відвідував жодних курсів літературної майстерності, лекцій, семінарів, не починав спочатку з малих оповідань, - відразу, з наскоку, взявся за великий роман. Не робіть так. Серйозно, не повторюйте моїх помилок. Це було важко.`,
  text5: `Але я дуже впертий, і якщо вже беруся за щось, то завжди доводжу до кінця. Такий от прикрий характер. Дуже допомогла мені тоді сама Ірина, яка навчила мене азам письма й правильної побудови речень. Віддавала мені шматки тексту з суцільною стіною червоних правок. Знову і знову. Аж поки, поступово, червоного кольору робилося все менше і менше. Не всім щастить мати на початках персонального редактора. Велике дякую тобі, Іро. Сподіваюся, не сильно тебе розчарував.`,
  text6: `Втім, писався текст довго. Досить довго. Писався і переписувався, давався бетарідерам, вичитувався і знову редагувався й редагувався. Бо, в наслідок вродженої самокритичності, текст мені здавався ще дуже сирим і недоробленим. І я міг переписувати його до безкінечності.`,
  text7: `Аж поки в один прекрасний день в мене його майже насильно не забрали і не відправили у видавництва. І хоч я ніяк не хотів його відпускати, але врешті, здався. Зрозумів, що ідеал – це така досить ефемерна штука, яку, на жаль, ніяк не досягти.`,
  text8: `І дуже здивувався, коли не пройшло й двох місяців, як на текст знайшлося відразу декілька видавництв, які захотіли його видати. Чесно кажучи, я був в легкому шоці, бо вважав (і все ще вважаю), його не таким вже й сильним. Але, врешті, «Вітер у голові» таки знайшов свій прихисток в прекрасній Темпорі, за що я їм дуже вдячний. Деколи й досі не віриться, що моя мрія – тримати в руках свою реальну, не вигадану фізичну книжку, бачити її на поличці, читати відгуки, відчувати реакцію людей, яким вона сподобалася – таки здійснилася. Чудове, нове незвичне відчуття.`,
  text9: `Наразі я пишу вже другий роман і нарешті розумію, чого саме не вистачало мені все життя. Сам процес писання виявився дуже терапевтичним для мене, і надзвичайно заспокійливим. А ще, вигадувати нові історії  - це дуже весело. Щиро раджу, це варто спробувати. Бо, як виявилось, почати – ніколи не пізно.`,
  text10: `Незважаючи на постійний брак часу, я все-таки намагаюся виділити його краплю і для інших моїх захоплень: я фанат лондонського Арсеналу та ЛА Лейкерс - тому подивитись пряму транляцію АПЛ або НБА чи переглянути їх матчі в записі - справжній кайф для мене, від якого важко відмовитись. Крім того я люблю й сам побігати на баскетбольному майданчику з друзями.`,
  text11: `Ще одним з моїх захоплень - є мій старенький потертий MTB. Наші з ним швидкісні поїздки по навколишній природі дозволяють покинути на деякий час цей проблемний світ та поринути у світ роздумів, розумового відпочинку та релаксації, драйву та швидкості, де існує лише вітер у голові...`,
};

export const myBooks = [
  {
    id: 1,
    book: true,
    name: 'Вітер у голові',
    type: 'роман',
    cover: windCover,
    published: 'Київ, "ТЕМПОРА", 2025р',
    genre: 'пригоди/фентезі/сатира',
    pages: 312,
    text: 'Щоб трохи підзаробити, львівський велокур’єр Максим бере участь у дослідженні експериментальної вакцини. Під час процедури стається помилка, яка викликає низку наступних шалених подій: впродовж одного насиченого тижня на Максима звалюється величезна купа труднощів та пригод: погоні на велосипедах, бійки, молодіжні субкультури, дівчата, проблеми з грошима, наркотиками, криміналітетом та поліцією, та ще й раптові головні болі й дивні запаморочення. Події розгортаються дедалі карколомніше, і хлопець намагається розплутати цей дивний клубок подій. Чи вдасться йому це?',
  },
  {
    id: 2,
    book: false,
    name: 'Жертва',
    type: 'коротке оповідання (уривок)',
    cover: writing,
    published: 'невидане',
    genre: 'пригодницьке',
    pages: '-',
    text: 'Тудук-тудук! Тудук-тудук! Серце несамовито стукотіло й, здавалося, ось-ось вистрибне з грудей. Я біг через ліс, не розбираючи і постійно озирався через плече. Колючі гілки кущів дряпали шкіру, боляче штрикали в боки. Вони були вже десь поряд, я чув їхні голоси. Ноги підкошувались, я постійно об щось перечіпався і падав на коліна. Повз на карачках, переповзав під поваленими деревами, хапаючи ротом вологе повітря, яке обпікало легені. Намагався врятувати своє нікчемне життя. Біля вуха щось просвистіло і з глухим стуком вдарилось в стовбур переді мною. Арбалетний болт. Я на мить завмер, страх скував мене, паралізуючи. Вони вже зовсім близько. Ще трохи — і все скінчиться. — Бачу його! — пролунало просто позаду...',
  },
];

export const contacts = [
  {
    id: 1,
    name: 'Gmail',
    href: 'gansyk2@gmail.com',
    Component: GmailIcon,
    color: '#e62e2e',
  },
  {
    id: 2,
    name: 'Facebook',
    href: 'https://www.facebook.com/profile.php?id=100063026647521',
    Component: FacebookIcon,
    color: '#6824e6',
  },
  {
    id: 3,
    name: 'Instagram',
    href: 'https://www.instagram.com/gans.gans7',
    Component: InstagramIcon,
    color: '#ff5495',
  },
  {
    id: 4,
    name: 'Telegram',
    href: 'https://t.me/gans1313',
    Component: TelegramIcon,
    color: '#2c86ec',
  },
  // {
  //   id: 5,
  //   name: 'WhatsApp',
  //   href: 'https://x.com/notifications',
  //   Component: WhatsappIcon,
  //   color: '#05a30d',
  // },
  {
    id: 6,
    name: 'X (Twitter)',
    href: 'https://x.com/@gans_gansyk',
    Component: XIcon,
    color: '#000000',
  },
];
